app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "another article"], ["author", "angelo"], ["content", "adlaksjdfklasjdflasdkjf"], ["created_at", "2015-01-09 23:20:31.435706"], ["updated_at", "2015-01-09 23:20:31.435706"]]
---
  def create
    new_article = params.require(:article).permit(:title, :author, :content)
    article = Article.create(new_article)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "first blog post (edited)"], ["updated_at", "2015-01-09 23:02:49.217774"], ["id", 1]]
---
  def update
    article = Article.find(params[:id])

    # get updated attributes
    updated_attributes = params.require(:article).permit(:title, :author, :content)

    # update the articles
    article.update_attributes(updated_attributes)